
## Terraform plan for environment: `dev`

**Commit:** 8a1beba2dce8db9e6a672af1807510f63dfd06ff


**API version:** 8a1beba
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`3 to add, 2 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
```
**🔄 Updates**

```tf
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E3R9S2AKJG4ZTR"
        tags                            = {}
        # (22 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com" -> null
          - origin_access_control_id = "E36O3W59HN75PX" -> null
          - origin_id                = "s3_oac_dev" -> null
          - origin_path              = "/8c2320a" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = "E36O3W59HN75PX"
          + origin_id                = "s3_oac_dev"
          + origin_path              = "/8a1beba"
        }

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "vol-app-dev-api-service"
      + task_role_arn        = (known after apply)
    }

  # module.service.module.ecs_service["api"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-api-cluster/vol-app-dev-api-service"
        name                               = "vol-app-dev-api-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-dev-api-service:28" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-api-service:28" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "APP_VERSION"
                          ~ value = "418eb0c" -> "8a1beba"
                        },
                        {
                            name  = "ENVIRONMENT_NAME"
                            value = "DEV"
                        },
                    ]
                  ~ image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/api:418eb0c" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/api:8a1beba"
                    name                   = "api"
                    # (13 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "vol-app-dev-api-service" -> (known after apply)
      ~ revision                 = 28 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-inbox"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-inbox"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-inbox-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 01 * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:3"
                  + JobName       = "vol-app-dev-process-inbox"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

  # module.service.module.eventbridge.aws_scheduler_schedule.this["process-ntu"] will be created
  + resource "aws_scheduler_schedule" "this" {
      + arn                          = (known after apply)
      + description                  = "Schedule for vol-app-dev-process-ntu"
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "process-ntu-schedule"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(45 01 * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:batch:submitJob"
          + input    = jsonencode(
                {
                  + JobDefinition = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:3"
                  + JobName       = "vol-app-dev-process-ntu"
                  + JobQueue      = "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default"
                }
            )
          + role_arn = "arn:aws:iam::054614622558:role/default"
        }
    }

Plan: 3 to add, 2 to change, 1 to destroy.

```

</details>